In [11]:
import numpy as np
import pandas as pd

In [12]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }

df = pd.DataFrame(dict1)
df.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [13]:
df.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [14]:
df.shape

(7, 3)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [16]:
# check null values
df.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [17]:
df.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [18]:
df["Gender"].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [25]:
# Find Total Number of Students Having Marks Between 90 To 100 
df.loc[(df["Marks"] >= 90) & (df["Marks"] <= 100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [26]:
# avg marks
df["Marks"].mean()

92.14285714285714

### Crate Gender_Numeric col and drop initial Gender col

In [28]:
df["Gender_Numeric"] = df["Gender"].map({"Male":1, "Female":0})
df.drop("Gender", axis=1, inplace=True)
df.head()

      Name  Marks  Gender_Numeric
0  Priyang     98               1
1   Aadhya     89               0
2   Krisha     99               0
3   Vedant     87               1
4   Parshv     90               1

### Sort The Dataframe As Per The Marks Column

In [32]:
sorted = df.sort_values(by="Marks", ascending=False)
sorted

      Name  Marks  Gender_Numeric
2   Krisha     99               0
6  Archana     99               0
0  Priyang     98               1
4   Parshv     90               1
1   Aadhya     89               0
3   Vedant     87               1
5   Mittal     83               0

### Display Name & Marks of The Female Students

In [39]:
df.loc[df["Gender_Numeric"] == 0, ["Name", "Marks"]]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99